In [1]:
print("hello") ;

hello

In [2]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.5.0-cp312-cp312-manylinux_2_28_x86_64.whl.metadata (7.5 kB)
Downloading mysql_connector_python-9.5.0-cp312-cp312-manylinux_2_28_x86_64.whl (34.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 34.1/34.1 MB 54.2 MB/s eta 0:00:00m eta 0:00:010:01:01
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.5.0

In [3]:
import mysql.connector as connector
connection = connector.connect(
    user ="bracoul",
    password= "kungfu",
    host = "localhost",
    port= 3306
)

In [5]:
cursor = connection.cursor(buffered=True);

In [7]:
try:
    cursor.execute("create database data_py")
except:
    cursor.execute("drop database data_py ")
    cursor.execute("create database data_py")
print(" la Base de donnée a eté crée \n")

 la Base de donnée a eté crée

In [6]:
cursor.execute(" use data_py") ;
print("The database data_py is set for use. \n")

The database data_py is set for use.

In [9]:
#The sql query MenuItems table is :
create_menuitem_table="""
create table MenuItems(
ItemID int auto_increment,
Name varchar(200),
Type varchar(100),
price int,
primary key(ItemID)
);"""
# create MenuItems table
cursor.execute(create_menuitem_table);
print("table MenuItems vient d'\être crée \n");

# create_menu_table
create_menu_table="""
create table  Menus(
MenuID int,
ItemID int,
Cuisine varchar(100),
primary key(MenuID,ItemID)
);"""
cursor.execute(create_menu_table) ;
print("table Meun vient d'etre crée. \n")

#creattion menu booking
create_booking_table="""
create table Bookings(
BookingID int auto_increment,
TableNo int,
GuestFirstName varchar(100) not null,
GuestLastName varchar(100) not null,
BookingSlot TIME not null,
EmployeeID int,
primary key(BookingID)
);"""

cursor.execute(create_booking_table);
print("table Booking vient d'etre crée. \n") ;

#creation table orders
create_orders_table="""
create table Orders(
OrderId int,
TableNo int,
MenuID int,
BookingID INT,
BillAmount int,
Quantity int,
primary key(OrderId,TableNo)
);"""

cursor.execute(create_orders_table) ;
print("table Orders vient d'etre crée.\n") ;
#La confirmation des tables crée
print(" l'ensemble des tables de ma base de donnée viennent d'etre crée \n");
cursor.execute("show tables")

for i in cursor:
    print(i)

table MenuItems vient d'\être crée

table Meun vient d'etre crée.

table Booking vient d'etre crée.

table Orders vient d'etre crée.

 l'ensemble des tables de ma base de donnée viennent d'etre crée

('Bookings',)
('MenuItems',)
('Menus',)
('Orders',)

In [7]:
print("Database name is :",connection.database)
print()

Database name is : data_py

In [8]:
insert_menuitmes="""
INSERT INTO MenuItems (ItemID, Name, Type, Price)
VALUES
(1,'Olives','Starters',5),
(2,'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10,'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

insert_menu="""
INSERT INTO Menus (MenuID,ItemID,Cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

insert_bookings="""
INSERT INTO Bookings (BookingID, TableNo, GuestFirstName, 
GuestLastName, BookingSlot, EmployeeID)
VALUES
(1,12,'Anna','Iversen','19:00:00',1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5);"""

insert_orders="""
INSERT INTO Orders (OrderID, TableNo, MenuID, BookingID, Quantity, BillAmount)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""

print("insertions  table MenuItems") ;

cursor.execute(insert_menuitmes)
print("total number of rows in MenuItem table :",cursor.rowcount);
connection.commit();
print("insertion dans le table Menu");
cursor.execute(insert_menu);
connection.commit();
print("total number of row in Menu table :",cursor.rowcount);
print("insertion table booking");
cursor.execute(insert_bookings);
connection.commit();
print("total number of row Bookings table :",cursor.rowcount);
print("insertion Orders");
cursor.execute(insert_orders);
connection.commit();
print("total number of row Orders :",cursor.rowcount) ;

insertions  table MenuItems

IntegrityError: 1062 (23000): Duplicate entry '1' for key 'PRIMARY'

In [9]:
cursor.execute("SELECT * FROM Menus")
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 1, 'Greek')
(1, 7, 'Greek')
(1, 10, 'Greek')
(1, 13, 'Greek')
(2, 3, 'Italian')
(2, 9, 'Italian')
(2, 12, 'Italian')
(2, 15, 'Italian')
(3, 5, 'Turkish')
(3, 11, 'Turkish')
(3, 16, 'Turkish')
(3, 17, 'Turkish')

In [13]:
all_bookings ="""SELECT GuestFirstName, GuestLastName, 
TableNo FROM Bookings ;"""

cursor.execute(all_bookings) ;

In [14]:
result =cursor.fetchall();

In [15]:
print(result) ;

[('Anna', 'Iversen', 12), ('Joakim', 'Iversen', 12), ('Vanessa', 'McCarthy', 19), ('Marcos', 'Romero', 15), ('Hiroki', 'Yamane', 5), ('Diana', 'Pinto', 8)]

In [16]:
cols = cursor.column_names
print(cols)

('GuestFirstName', 'GuestLastName', 'TableNo')

In [17]:
for i in result:
    print(i) ;

('Anna', 'Iversen', 12)
('Joakim', 'Iversen', 12)
('Vanessa', 'McCarthy', 19)
('Marcos', 'Romero', 15)
('Hiroki', 'Yamane', 5)
('Diana', 'Pinto', 8)

In [10]:
all_menu ="""select *from  Menus ;"""
cursor.execute(all_menu) ;

In [12]:
resultat =cursor.fetchmany(size=3) ;

In [13]:
col = cursor.column_names

In [14]:
print(col) ;

('MenuID', 'ItemID', 'Cuisine')

In [15]:
for i in resultat:
    print(i) ;

(1, 1, 'Greek')
(1, 7, 'Greek')
(1, 10, 'Greek')

In [20]:
update_bookings= """
update Bookings set TableNo =3 where BookingID = 1;"""
print(" execution update query")
cursor.execute(update_bookings)
connection.commit()
print(" record is update in the table")

 execution update query
 record is update in the table

In [21]:
all_booking ="""select *from Bookings;"""

cursor.execute(all_booking) ;

results = cursor.fetchall()
colss = cursor.column_names
print("data in the Booking table")
print(colss)
for i in results:
    print(i)

data in the Booking table
('BookingID', 'TableNo', 'GuestFirstName', 'GuestLastName', 'BookingSlot', 'EmployeeID')
(1, 3, 'Anna', 'Iversen', datetime.timedelta(seconds=68400), 1)
(2, 12, 'Joakim', 'Iversen', datetime.timedelta(seconds=68400), 1)
(3, 19, 'Vanessa', 'McCarthy', datetime.timedelta(seconds=54000), 3)
(4, 15, 'Marcos', 'Romero', datetime.timedelta(seconds=63000), 4)
(5, 5, 'Hiroki', 'Yamane', datetime.timedelta(seconds=66600), 2)
(6, 8, 'Diana', 'Pinto', datetime.timedelta(seconds=72000), 5)

In [ ]:
UPDATE_BOOKING ="""
UPDATE Bookings set TableNo=11,EmployeeID=6 where BookingID =2;"""
cursor.execute(UPDATE_BOOKING) ;
print("les donnée on eté changer");
print("commit table");
connection.commit();
print("les donné on eté changer");

les donnée on eté changer
commit table
les donné on eté changer

In [ ]:
all_book ="""
select *from Bookings"""
cursor.execute(all_book) ;
resutats = cursor.fetchall();
cols = cursor.column_names
print(" les donnees table Book")
print(cols)
for i in resutats:
    print(i) ;

 les donnees table Book
('BookingID', 'TableNo', 'GuestFirstName', 'GuestLastName', 'BookingSlot', 'EmployeeID')
(1, 3, 'Anna', 'Iversen', datetime.timedelta(seconds=68400), 1)
(2, 11, 'Joakim', 'Iversen', datetime.timedelta(seconds=68400), 6)
(3, 19, 'Vanessa', 'McCarthy', datetime.timedelta(seconds=54000), 3)
(4, 15, 'Marcos', 'Romero', datetime.timedelta(seconds=63000), 4)
(5, 2, 'Hiroki', 'Yamane', datetime.timedelta(seconds=66600), 2)
(6, 8, 'Diana', 'Pinto', datetime.timedelta(seconds=72000), 5)

In [ ]:
delete_query ="""delete from Menus where Cuisine ='Greek';"""
cursor.execute(delete_query)
print(" commit")
connection.commit();
print(" the table is upgrate after deletion of the requested records") ;

 commit
 the table is upgrate after deletion of the requested records

In [ ]:
all_menu= """select *from Menus;"""
cursor.execute(all_menu) ;
resultat =cursor.fetchall();
cols = cursor.column_names
print(cols) ;
for i in resultat:
    print(i) ;

('MenuID', 'ItemID', 'Cuisine')
(2, 3, 'Italian')
(2, 9, 'Italian')
(2, 12, 'Italian')
(2, 15, 'Italian')
(3, 5, 'Turkish')
(3, 11, 'Turkish')
(3, 16, 'Turkish')
(3, 17, 'Turkish')

In [ ]:
delete_query_null = """delete from Bookings where TableNo is null ;"""
cursor.execute(delete_query_null) ;
connection.commit();

In [ ]:
filtering_and_sorting ="""
select TableNo, GuestFirstName, GuestLastName,EmployeeID
from Bookings
where TableNo =3
;"""
cursor.execute(filtering_and_sorting)
results = cursor.fetchall()
cols = cursor.column_names
print(cols)
for i in results:
    print(i)

('TableNo', 'GuestFirstName', 'GuestLastName', 'EmployeeID')
(3, 'Anna', 'Iversen', 1)

In [ ]:
filtering_and_sorting = """
SELECT BookingID, BillAmount
FROM Orders order by  BillAmount desc;"""

cursor.execute(filtering_and_sorting)
result =cursor.fetchmany(size=5)
colu = cursor.column_names
print(colu)
for i in result:
    print(i)

('BookingID', 'BillAmount')
(1, 86)
(5, 43)
(4, 40)
(2, 37)
(3, 37)

In [ ]:
filtering_and_sorting = """
SELECT BookingID, BillAmount
FROM Orders order by  BillAmount desc limit 2;"""

cursor.execute(filtering_and_sorting)
result =cursor.fetchall()
colu = cursor.column_names
print(colu)
for i in result:
    print(i)

('BookingID', 'BillAmount')
(1, 86)
(5, 43)

In [10]:
filtering = """select *from MenuItems where(type ='Starters'or type ='Desserts')
order by Price asc"""
cursor.execute(filtering)
results= cursor.fetchall()
col = cursor.column_names
print(col)
for i in results:
    print(i)

('ItemID', 'Name', 'Type', 'price')
(12, 'Cheesecake', 'Desserts', 4)
(1, 'Olives', 'Starters', 5)
(2, 'Flatbread', 'Starters', 5)
(6, 'Hummus', 'Starters', 5)
(11, 'Ice cream', 'Desserts', 6)
(5, 'Falafel', 'Starters', 7)
(10, 'Greek yoghurt', 'Desserts', 7)
(3, 'Minestrone', 'Starters', 8)
(4, 'Tomato bread', 'Starters', 8)

| Type de jointure | Description                                                              | Lignes retournées           |
| ---------------- | ------------------------------------------------------------------------ | --------------------------- |
| **INNER JOIN**   | Correspondances uniquement                                               | Lignes communes             |
| **LEFT JOIN**    | Tous les enregistrements de gauche + correspondances à droite            | Tous les éléments de gauche |
| **RIGHT JOIN**   | Tous les enregistrements de droite + correspondances à gauche            | Tous les éléments de droite |
| **FULL JOIN**    | Toutes les lignes des deux tables (avec `NULL` si pas de correspondance) | Toutes les lignes           |
| **SELF JOIN**    | Jointure d’une table avec elle-même                                      | Comparaisons internes       |

In [ ]:
join_query ="""
select MenuItems.Name,
MenuItems.type,
Menus.Cuisine,
MenuItems.Price from MenuItems
inner join Menus on MenuItems.ItemID =Menus.ItemID ;"""

cursor.execute(join_query)
result = cursor.fetchall();
cols = cursor.column_names;
print(cols)
for i in result:
    print(i)

('Name', 'type', 'Cuisine', 'Price')
('Olives', 'Starters', 'Greek', 5)
('Greek salad', 'Main Courses', 'Greek', 15)
('Greek yoghurt', 'Desserts', 'Greek', 7)
('Athens White wine', 'Drinks', 'Greek', 25)
('Minestrone', 'Starters', 'Italian', 8)
('Pizza', 'Main Courses', 'Italian', 15)
('Cheesecake', 'Desserts', 'Italian', 4)
('Turkish Coffee', 'Drinks', 'Italian', 10)
('Falafel', 'Starters', 'Turkish', 7)
('Ice cream', 'Desserts', 'Turkish', 6)
('Turkish Coffee', 'Drinks', 'Turkish', 10)
('Kabasa', 'Main Courses', 'Turkish', 17)

In [29]:
join_query =""" 
select MenuItems.Name,
MenuItems.Type,
Menus.Cuisine,
MenuItems.Price 
from MenuItems
left join Menus on MenuItems.ItemID = Menus.ItemID
where Cuisine is null  ;"""

cursor.execute(join_query)
result = cursor.fetchall()
col = cursor.column_names;
print(col)
for i in result:
    print(i)

('Name', 'Type', 'Cuisine', 'Price')
('Flatbread', 'Starters', None, 5)
('Tomato bread', 'Starters', None, 8)
('Hummus', 'Starters', None, 5)
('Bean soup', 'Main Courses', None, 12)
('Corfu Red Wine', 'Drinks', None, 30)

In [32]:
join_query=""" 
select Bookings.BookingID,
Bookings.TableNo,
Bookings.GuestFirstName,
Bookings.EmployeeID,
Orders.BillAmount
from Bookings
left join Orders on Bookings.BookingID = Orders.BookingID
  ;"""
cursor.execute(join_query) ;

result =cursor.fetchall();
cols =cursor.column_names
print(cols)
for i in result:
    print(i)

('BookingID', 'TableNo', 'GuestFirstName', 'EmployeeID', 'BillAmount')
(1, 3, 'Anna', 1, 86)
(2, 12, 'Joakim', 1, 37)
(3, 19, 'Vanessa', 3, 37)
(4, 15, 'Marcos', 4, 40)
(5, 5, 'Hiroki', 2, 43)
(6, 8, 'Diana', 5, None)

In [42]:
sql_query ="""
select BookingID  AS ID,
UPPER(CONCAT(GuestFirstName, ' ',GuestLastName ))AS GuestFullName 
from Bookings
 ;"""
cursor.execute(sql_query) ;
result = cursor.fetchall();
cols = cursor.column_names;
print(cols)
for i in result:
    print(i)

('ID', 'GuestFullName')
(1, 'ANNA IVERSEN')
(2, 'JOAKIM IVERSEN')
(3, 'VANESSA MCCARTHY')
(4, 'MARCOS ROMERO')
(5, 'HIROKI YAMANE')
(6, 'DIANA PINTO')

In [16]:
sql_query ="""select count(BookingID) as nombre_Booking,
SUM(BillAmount)as total_vente,
avg(BillAmount) as moyenne_total
from Orders ;"""
cursor.execute(sql_query) ;
result = cursor.fetchall();
cols = cursor.column_names ;
print(cols);
for i in result:
    print('nombre_Booking',i[0]);   
    print('total_vente',i[1]);    
    print('moyenne des vente',i[2]);

('nombre_Booking', 'total_vente', 'moyenne_total')
nombre_Booking 5
total_vente 243
moyenne des vente 48.6000

In [8]:
sql_query = """select TableNo ,
count(TableNo) as Numero_Booking 
from Bookings 
GROUP BY TableNo 
ORDER BY Numero_Booking DESC;"""
cursor.execute(sql_query) ;
result = cursor.fetchall()
cols = cursor.column_names ;
print(cols);
for i in result:
    print(i)

('TableNo', 'Numero_Booking')
(3, 1)
(12, 1)
(19, 1)
(15, 1)
(5, 1)
(8, 1)

In [17]:
sql_query="""
SELECT
BookingID,
CONCAT(GuestFirstName,' ',GuestLastName) AS Guest_Name,
case
when hour(BookingSlot) in (15,16) then 'matinal'
when hour(BookingSlot) in (17,18) then 'journée '
when hour(BookingSlot) in (19,20) then 'soire'
else 'le nest pas disponible'
END as arrival 
from Bookings
 ;"""

cursor.execute(sql_query) ;
result = cursor.fetchall()
cols = cursor.column_names;
print(cols)
for i in result:
    print(i)

('BookingID', 'Guest_Name', 'arrival')
(1, 'Anna Iversen', 'soire')
(2, 'Joakim Iversen', 'soire')
(3, 'Vanessa McCarthy', 'matinal')
(4, 'Marcos Romero', 'journée ')
(5, 'Hiroki Yamane', 'journée ')
(6, 'Diana Pinto', 'soire')

In [18]:


cursor = connection.cursor(buffered=True)

if connection.is_connected():   
    cursor.close()
    print("The cursor is closed.")
    connection.close()
    print("MySQL connection is closed.")
else:
    print("Connection is already closed")

The cursor is closed.
MySQL connection is closed.